Repository: intelligenia/curso-django-rest-framework-basico
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: es

source: User account is disabled.
es: La cuenta de usuario está desabilitada.

source: Unable to log in with provided credentials.
es: Imposible logear con estos credenciales.

source: Must include "username" and "password"
es: Debería incluir "nombre_usuario" y "contraseña".

source: A server error occured
es: Ocurrió un error en el servidor.

source: Malformed request.
es: Respuesta malformada.

source: Incorrect authentication credentials.
es: Credenciales de autenticación incorrectos.

source: Authentication credentials were not provided.
es: La autenticación de credenciales no estaba previsto.

source: You do not have permission to perform this action.
es: No tienes permisos para realizar esta acción.

source: Method '%s' not allowed.
es: Método '%s' no permitido.

source: Could not satisfy the request Accept header
es: Podría no satisfacer la cabecera 'aceptar' de la petición

source: Unsupported media type '%s' in request.
es: No soportado el tipo '%s' en la respuesta.

source: Request was throttled.
es: La respuesta fue regulada.

source: Expected available in %(wait)d second.
es: Espere, disponible en %(wait)d segundo.

source: This field is required.
es: Este campo es obligatorio.

source: This field may not be null.
es: Este campo no debería ser nulo.

source: `{input}` is not a valid boolean.
es: `{input}` no es un booleano valido.

source: This field may not be blank.
es: Este campo no debería estar en blanco.

source: Ensure this field has no more than {max_length} characters.
es: Asegúrese que este campo no tiene más de {max_length} carácteres.

source: Ensure this field has no more than {min_length} characters.
es: Asegúrese que este campo tenga al menos {min_length} carácteres.

source: Enter a valid email address.
es: Introduzca una dirección de correo electrónico válida.

source: This value does not match the required pattern.
es: Este valor no coincide con el patrón requerido.

source: Enter a valid 'slug' consisting of letters, numbers, underscores or hyphens.
es: Introduzca un 'slug' válido, consistente en letras, números, guiones bajos o medios.

source: Enter a valid URL.
es: Introduzca una URL válida.

source: A valid integer is required.
es: Se requiere un entero válido.

source: Ensure this value is less than or equal to {max_value}.
es: Asegúrese de que este valor sea menor o igual a{max_value}.

source: Ensure this value is greater than or equal to {min_value}.
es: Asegúrese que este valor es mayor o igual a {min_value}.

source: String value too large
es: Valor de la cadena muy grande.

source: A valid number is required.
es: Se requiere un número válido.

source: Ensure that there are no more than {max_digits} digits in total.
es: Asegúrese de que no exista en total mas de {max_digits} digitos.

source: Ensure that there are no more than {max_decimal_places} decimal places.
es: Asegúrese de que no existan más de {max_decimal_places} lugares decimales.

source: Ensure that there are no more than {max_whole_digits} digits before the decimal point.
es: Asegúrese de que no existan más de {max_whole_digits} dígitos antes del punto decimal.

source: Datetime has wrong format. Use one of these formats instead: {format}
es: Error en el formato Fecha-Hora. Use mejor uno de estos formatos: {format}.

source: Expected a datetime but got a date.
es: Esperaba una fecha-hora pero tomó una fecha.

source: Date has wrong format. Use one of these formats instead: {format}
es: Error en el formato de fecha. Use mejor uno de estos formatos: {format}.

source: Expected a date but got a datetime.
es: Esperaba una fecha pero tomó una hora-fecha.

source: Time has wrong format. Use one of these formats instead: {format}
es: Error en el formato de tiempo. Use mejor uno de estos formatos: {format}.

source: `{input}` is not a valid choice.
es: `{input}`no es una elección válida.

source: Expected a list of items but got type `{input_type}`.
es: Esperaba una lista de items pero tomó un tipo `{input_type}`.

source: No file was submitted.
es: No se ha enviado ningún fichero

source: The submitted data was not a file. Check the encoding type on the form.
es: El envío de datos no fue un fichero. Verifica la codificación de tipos dentro del formulario.

source: No filename could be determined.
es: El nombre del fichero no pudo ser determinado.

source: The submitted file is empty.
es: El fichero enviado está vacío.

source: Ensure this filename has at most {max_length} characters (it has {length}).
es: Asegúrese de que este nombre de archivo tenga como máximo {max_length} carácteres (tiene {length}).

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
es: Envíe una imagen válida. El fichero que ha enviado no era una imagen o se trataba de una imagen corrupta.

source: Expected a list of items but got type `{input_type}`
es: Esperaba una lista de items pero tomó el tipo `{input_type}`

source: Page is not 'last', nor can it be converted to an int.
es: La página no es la "ultima", ni puede ser convertida a un entero.

source: Invalid page (%(page_number)s): %(message)s
es: Página inválida (%(page_number)s): %(message)s

source: Object with {slug_name}={value} does not exist.
es: Objetos con {slug_name}={value} no existen.

source: Invalid value.
es: Valor inválido

source: Invalid data. Expected a dictionary, but got {datatype}.
es: Dato inválido. Esperaba un diccionario, pero tomó {datatype}.

source: This field must be unique.
es: Este campo debería ser único.

source: The fields {field_names} must make a unique set.
es: Los campos {field_names} deberían marcar una única selección.

source: This field must be unique for the "{date_field}" date.
es: Este campo deberia ser único para el "{date_field}" dia.

source: This field must be unique for the "{date_field}" month.
es: Este campo deberia ser único para el "{date_field}" mes.

source: This field must be unique for the "{date_field}" year.
es: Este campo debería ser único para el "{date_field}" año.
